In [1]:
import mysql.connector as connection

In [35]:
con=connection.connect(host='localhost',database='Student',user='root',passwd='nitin',use_pure=True)

In [16]:
query='show databases'

In [23]:
cursor=con.cursor()

In [24]:
cursor.execute(query)

In [25]:
cursor.fetchall()

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('student',),
 ('sys',),
 ('world',)]

In [22]:
for i in cursor.fetchall():
    print(i)

In [30]:
cursor=con.cursor()

In [21]:
cursor.execute('create database Student')

In [31]:
cursor.execute('create table Student(name varchar(100))')

In [36]:
cursor=con.cursor()

In [69]:
cursor.execute('insert into Student values("nitin kumar")')
cursor.execute('insert into Student values("nitin kumar")')
con.commit()

In [63]:
con=connection.connect(host='localhost',database='Student',user='root',passwd='nitin',use_pure=True)

In [64]:
cursor=con.cursor()

In [65]:
cursor.execute('select * from Student')

In [66]:
for i in cursor.fetchall():
    print(i)

('nitin kumar',)
('nitin kumar',)

In [67]:
import pandas as pd

In [70]:
pd.read_sql('select * from Student',con)

          name
0  nitin kumar
1  nitin kumar
2  nitin kumar
3  nitin kumar